#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/h4ystack/tfgh/runs/run-hyUnqPp5BgFXzkcP

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.tfgh: Refreshing state... [id=tfgh]
github_branch_protection.dotfiles: Refreshing state... [id=BPR_kwDOICFt3s4B6uGN]
github_branch_protection.tfgh: Refreshing state... [id=BPR_kwDOInxuDs4B6wD3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.tfgh will be updated in-place
  ~ resource "github_branch_protection" "tfgh" {
        id                              = "BPR_kwDOInxuDs4B6wD3"
        # (11 unchanged attributes hidden)

      ~ required_status_checks {
          ~ contexts = [
              - "Terraform",
              + "github/terraform",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_repository.dyson will be created
  + resource "github_repository" "dyson" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "dynamic json parser implemented by rust"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dyson"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @hayas1, Action: `pull_request`*